import sys
from itertools import product

# 중복 순열 돌리기
# 10=3*3+1 -> 4
# 3^10 = 59049 -> 6만번 * 4 -> 24만번 -> 돌릴만함
# 메모리...?

def how_many_case(x):
    case = 0

    lower = (x-1) // 3 + 1

    for i in range(lower, x+1):
        nums_list = product(range(1,4), repeat= i)
        for nums in nums_list:
            if sum(nums) == x:
                case += 1

    return case


testcase_num = int(input())
for i in range(testcase_num):
    testcase = int(sys.stdin.readline().replace("\n", ""))
    print(how_many_case(testcase))






"""
1: 1 -> 1
2: 2/1+1 ->2
3: 3/2+1/1+2/1+1+1 ->4 
4: 3+1/1+3/2+2/2+1+1/1+2+1/1+1+2/1+1+1+1 -> 7 
5: 3+2/2+3/3+1+1/1+3+1/1+1+3/2+2+1/2+1+2/1+2+2/2+1+1+1/1+2+1+1/1+1+2+1/1+1+1+2/1+1+1+1+1 -> 13 
6: 3+3/3+2+1(6)/3+1+1+1+1(5)/2+2+2/2+2+1+1(6)/2+1+1+1+1(5)/1+1+1+1+1+1 -> 25
7: 3+3+1(3)/3+2+2(3)/3+2+1+1(12)/3+1+1+1+1(5)/2+2+2+1(4)/2+2+1+1+1(10)/2+1+1+1+1+1(6)/1+1+1+1+1+1+1 -> 44


1,2/3,6,12/19,

5이면
a+b+c+d+e = 5 -> 5H0 -> 4C0
a+b+c+d = 5 -> 4H1 -> 4C1
a+b+c = 5 -> 3H2 -> 4C2
a+b=5 -> 2H3 - 2 -> 4C3-2

2^4-(1+2) = 2^4 - 3 = 2^4 - 3*1




6이면
a+b+c+d+e+f = 6 -> 6H0 -> 5C0
a+b+c+d+e = 6 -> 5H1 -> 5C1
a+b+c+d = 6 -> 4H2 -> 5C2
a+b+c= 6 -> 3H3 - 3 -> 5C3 - 3
a+b = 6 -> 2H4 - (2+2) -> 5C4 - 4

2^5 - (1+3+4) = 2^5-8 = 2^5 - 4*2
32-8

7이면
a+b+c+d+e+f+g = 7 -> 7H0 -> 6C0
a+b+c+d+e+f = 7 -> 6H1 -> 6C1
a+b+c+d+e = 7 -> 5H2 -> 6C2
a+b+c+d = 7 -> 4H3 - 4 -> 6C3 -4
a+b+c = 7 -> 3H4- (3+6) -> 6C4 -9

2^6-(1+6+9+4) =  2^6-20 = 2^6 - 5*4


8이면
a+b+c+d+e+f+g+h = 8 -> 8H0 -> 7C0
a+b+c+d+e+f+g = 8 -> 7H1 -> 7C1
a+b+c+d+e+f = 8 -> 7H2 -> 7C2
a+b+c+d+e = 8 -> 5H3 -5 -> 7C3 -5
a+b+c+d = 8 -> 4H4- (4+12) -> 7C4 -16
a+b+c = 8 -> 3H5 - (3+6+6+3) -> 7C5 - 18

2^7 - (1+7+18+16+5) = 2^7 - (47)...?




"""


